# 3) შექმენით ორი ცვლადი და მათში შეინახეთ რიცხვები. შეასრულეთ ყველა ის მათემატიკური ოპერაცია, რაც აქამდე ვისწავლეთ და თითოეული ეს 
# ოპერაცია შეინახეთ ცვლადებში. საბოლოოდ დაბეჭდეთ ამ ცვლადის მნიშვნელობები. რაც ყველაზე მთავარია - ამ დავალების შესრულებისას, 
# თითოეულ ხაზზე კომენტარიებით უნდა ახსნათ თუ რა მოქმედებებს ასრულებთ.

num1 = 2 # შევქმენი ცვლადი სახელად - num1 და მივანიჭე ინტეჯერის ტიპის მნიშვნელობა
num2 = 4 # აქაც შევქმენი ინტეჯერის მნიშვნელობის მქონე ცვლადი, ოღონდ სახელად - num2

# შვიდივე ოპერაციისთვის შევქმენი 7 ცვლადი, სათითაოში მოვახდენ ოპერაციებს და შემდეგ ამ ცვლადებს დავპრინტავ.
addition = num1 + num2 # ჩემი შექმნილი ორი ცვლადი შევკრიბე, ანუ მათზე მოვახდინე მათემატიკური ოპერაცია - მიმატება (+)
subtraction = num2 - num1 # ერთ ცვლადს გამოვაკელი მეორე, ანუ შევასრულე ოპერაცია - გამოკლება (-)
multiplication = num1 * num2 # ერთი ცვლადი მეორეზე გავამრავლე, შესრულდა გამრავლება (*)
division = num2 / num1 # მეორე ცვლადი პირველზე გავყავი, ოღონდ ტერმინალში პასუხი აუცილებლად ათწილადი იქნება (/)
floor_division = num2 // num1 # ცვლადების მნიშვნელობები ერთმანეთზე მეორე ნაირი გაყოფით გავყავი. ანუ, ტერმინალში გამოიტანს პასუხს, თუ რამდენჯერ მოთავსდება ერთი ცვლადი მეორეში (//)
exponentiation = num2 ** num1 # ერთი ცვლადის მნიშვნელობა მეორეთი ავახარისხე, ამ შემთხვევაში 4 ავიყვანე კვადრატში (**)
modulus = num2 % num1 # მეორე ცვლადის მნიშვნელობა გაიყოფა პირველზე და ტერმინალზე პასუხად მხოლოდ ნაშთი გამოვა (%)

# დავპრინტე შვიდივე ცვლადი, ყველა მათგანში თითო ოპერაციაა მოხდენილი პირველად შექმნილ 2 ცვლადს შორის.
print(addition) 
print(subtraction)
print(multiplication)
print(division)
print(floor_division)
print(exponentiation)
print(modulus)
