# 1)შექმენი 9 ცვლადი, 3 ცვლადი იყოს Str, 3 ცვლადი int, 3 ცვლადი float, და შემდეგ გამოიტანე ტერმინალში 9-ვე ცვლადი print-ის მეშვეობით.

#1)
print("Lika") #აკლდა ფრჩხილები

#2)
analyst_salary = 3000
print(analyst_salary) #print-ში ცვლადის სახელი არასწორად იყო ჩაწერილი (პატარა a-ს ნაცვლად იყო დიდი A).

#3)
n1 = 27
n2 = 12
print(n1 / n2) #n2 ცვლადის მნიშვნელობა იყო ბრჭყალებში, ანუ იყო სტრინგი. შესაბამისად, ინტეჯერს სტრინგზე ვერ გავყოფთ (სხვადასხვა ტიპის 
#მონაცემებია)

#4)
Status = "Mentor" #ცვლადის მნიშვნელობა სტრინგია, მაგრამ ის არ იყო ბრჭყალებში მოქცეული. 
print(Status) #print-ში ცვლადის სახელი არასწორად იყო ჩაწერილი (დიდი S-ს მაგივრად იყო პატარა s).