# 5) კომენტარების საშუალებით დეტალურად აღწერეთ თუ რას გამოიტანს ეს კოდი:
#    Use comments to describe in detail what this code will output:

obj = "Book"
#შეიქმნა ცვლადი სახელად - obj და მნიშვნელობით - Book.

print(obj + " pages")
#ეს მნიშვნელობა დაიპრინტება, მაგრამ მიემატება სტრინგი - " pages". ანუ გამოვა: Book pages

obj2 = obj + " page"
# შეიქმნება მეორე ცვლადიც, სახელად - obj2, ხოლო მასში შეინახება obj ცვლადს + " page". ანუ, ეს ცვლადი თუ პრინტ ფუნქციით გაეშვა, ტერმინალში
# გამოვა: Book page 

print(obj)
#საბოლოოდ დაიპრინტა პირველად შექმნილი ცვლადი, ყველანაირი კონკატინაციის გარეშე. obj2 ცვლადი არ დაპრინტულა პრინტ ფუნქციით, 
#ამიტომ ტერმინალში საბოლოო შედეგი იქნება: 

# Book pages
# Book